Tekla Open API Reference for Tekla Structures 2025
RebarGuideline.ChamferType Property
 Gets or sets the chamfer type of the guideline. To create longitudinal bars on the top/bottom face of a flat polybeam, create a guideline at each corner, and use the ARC_POINT chamfer type at "curved" corners, and NONE otherwise.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarGuideline.GuidelineChamferTypeEnum ChamferType { get; set; }
Public Property ChamferType As RebarGuideline.GuidelineChamferTypeEnum
	Get
	Set
Property Value
Type: RebarGuideline.GuidelineChamferTypeEnum
See Also
Reference
RebarGuideline Class
Tekla.Structures.Model Namespace